<?php

return [
    'store_connection_params_policy' => 'Параметри для підключення до баз даних зберігатимуться в зашифрованому вигляді. Додаток буде використовувати їх виключно під час процесу конвертації. Після завершення ви зможете видалити їх.',
    'unsupported_data_type' => "Тип даних :dataTypeName (повне ім'я: :dataType) бази даних :driver не підтримується.",
    'select_tables_policy' => "На даному кроці ви можете обрати таблиці, дані з яких потрібно конвертувати. Для більшості стовпців можливо змінити тип даних за потреби. Зверніть увагу: налаштувати організацію зв`язків ви зможете на наступному кроці.",
    'adjust_relationships_policy' => "Системою було сконфігуровано зв`язки між колекціями. На даному кроці ви зможете внести корективи до сформованих зв`язків.",

];