<?php

return [
    'general_requirements' => 'Загальні вимоги:',
    'sql_requirements' => 'Вимоги до реляційної бази даних:',
    'nosql_requirements' => 'Вимоги до нереляційної бази даних:',
    'provide_params' => 'Спершу оберіть тип реляційної бази даних та надайте параметри для підключення до неї. Також надайте параметри для підключення до бази даних MongoDB.',
    'test_connections' => 'The converter will test the connections.',
    'ensure_no_changes' => 'Будь ласка, переконайтесь, що в обидві бази даних не вносяться будь які зміни (оновлення даних, індексів, зв’язків) під час конфігурування або виконання конвертації.',

    'access_rights' => 'Права доступу:',
    'sql_acces_rights' => 'користувач бази даних повинен мати доступ на вибірку даних з цільової бази даних.',
    'nosql_acces_rights' => 'користувач MongoDB повинен мати роль <code>readWrite</code> або <code>dbAdmin</code> (для видалення конфліктних колекцій, створення нових колекцій та вставки документів).',

    'foreign_keys' => 'Зовнішні ключі:',
    'sql_foreign_keys' => 'всі зовнішні ключі (<code>foreign keys</code>) мають бути в межах однієї бази даних. Зовнішні ключі на інші бази даних будуть проігноровані.',

    'data_consistency' => 'Консистентність даних:',
    'nosql_data_consistency' => 'якщо таблиця має зовнішній ключ (<code>foreign key</code>), то всі його поля мають бути або <code>nullable</code>, або <code>non-nullable</code> (<code>required</code>). Комбінація може порушити цілісність даних і алгоритм не зможе коректно обробити такий зв`язок.',

    'lack_of_important_data:' => 'Відсутність важливих даних:',
    'nosql_lack_of_important_data:' => 'переконайтесь, що база даних MongoDB не містить важливі для Вас дані, щоб уникнути їх можливої втрати.',

    'avoiding_conflicts:' => 'Уникнення конфліктів:',
    'nosql_avoiding_conflicts:' => 'конвертер буде видаляти колекції з такою ж назвою, як таблиці реляційної бази даних.',
];